<a href="https://colab.research.google.com/github/SangeerthanaBalasubramaniam/Data-Science/blob/main/Introduction_to_Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

Creating DataFrame manually using Dictionary

In [2]:
weather_data = {
'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
'temperature': [32,35,28,24,32,31],
'windspeed': [6,7,2,7,4,2],
'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny'] #event is categorical data since Rain, Sunny etc are categories ie.divided into groups. #day and event are not numeric
}

In [3]:
df = pd.DataFrame(weather_data)

**Display data (first, last, sample, column titles)**

In [4]:
df # Dataframe displayed as Table - rows and columns

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
df.head(2) # displays first two rows of the dataframe. head represents starting.

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [6]:
df.tail(3) # displays last three rows of the dataframe.

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
df.sample(3) # gives some sample data rows from the dataframe, it is not sorted or not in any order.

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
0  1/1/2017           32          6  Rain

In [8]:
df.columns # returns an index list which contains column names.

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
df.dtypes # displayes datatypes of each column.

day            object
temperature     int64
windspeed       int64
event          object
dtype: object

In [10]:
df.dtypes['temperature'] # displayes datatype of specific column.

dtype('int64')

**Index (change, inplace, reset)**

In [11]:
df.set_index('day') # changes default index to day.

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

When changes/operations performed, it is reflected only in the copy and not on original dataframe. 

suggested: dg = df.set_index('day')

In [12]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

inplace: bool

inplace = True, Dataframe df will be updated.

inplace = False, copy of original dataframe is made.

In [13]:
df.set_index('day',inplace=True) # index of df dataframe is changed to 'day'

In [14]:
df

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

dg = df.set_index('day') # copy of the instance is stored in dg.

In [15]:
df.reset_index(inplace=True) # resets the index from 'day' to default (index will be displayed as in original created df).

**Selecting a subset of the DataFrame (one or multiple columns)**

Access a particular column

In [17]:
df['temperature'] # or

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [18]:
df.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [19]:
df.iloc[1:3] # displays the row by the range mentioned.

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [20]:
#[n, m] -> n represents row and m represents column. 
df.iloc[:,1:3] #display all rows with columns that are specified.

   temperature  windspeed
0           32          6
1           35          7
2           28          2
3           24          7
4           32          4
5           31          2

Accessing multiple columns

In [21]:
df[['temperature', 'event']]

   temperature  event
0           32   Rain
1           35  Sunny
2           28   Snow
3           24   Snow
4           32   Rain
5           31  Sunny

In [22]:
dg = df[['temperature', 'event']] 
dg

   temperature  event
0           32   Rain
1           35  Sunny
2           28   Snow
3           24   Snow
4           32   Rain
5           31  Sunny

**Info about whole DataFrame (info, describe, value_counts)**

Information about entire dataframe.

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

df.info() has dtypes in the output displayed. dtypes: summarizes there are two cols of dtype int64 and two columns of dtype object.

In [24]:
# Statistical info
df.describe()
# min, 25, 50, 75, max
# 50% is mid-value / median ie. 50th percentile.
# statistical data -> so we can only find mean with numerical datatype, in this case only temperature and windspeed will be displayed.

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [25]:
df[df['temperature']>30] # filters temperature greater than 30.

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [26]:
df['event'].value_counts() #represents a column and returns the count of each unique value in the column.
# output: 2 rows having value sunny, 2 rows having value rain and 2 rows having snow.

Snow     2
Sunny    2
Rain     2
Name: event, dtype: int64

**Deleting column(s) (inplace True/False)**

In [27]:
df.drop('event',axis=1) # to delete a column. axis=1 denotes column.
# event will not be dropped in original dataset instead done only in copy.

        day  temperature  windspeed
0  1/1/2017           32          6
1  1/2/2017           35          7
2  1/3/2017           28          2
3  1/4/2017           24          7
4  1/5/2017           32          4
5  1/6/2017           31          2

In [28]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

**Loading a dataset from a file/websource**

In [29]:
source = 'https://raw.githubusercontent.com/pplonski/datasets-for-start/master/credit/data.csv'

In [30]:
df = pd.read_csv(source)

In [31]:
df

            Id  ...  NumberOfDependents
0            1  ...                 2.0
1            2  ...                 1.0
2            3  ...                 0.0
3            4  ...                 0.0
4            5  ...                 0.0
...        ...  ...                 ...
149995  149996  ...                 0.0
149996  149997  ...                 2.0
149997  149998  ...                 0.0
149998  149999  ...                 0.0
149999  150000  ...                 0.0

[150000 rows x 12 columns]